roster/app/controllers/comments_controller.rb

SELECT * FROM "comments"
---
  def index
    if @user
      @comments = @user.comments
    else
      @comments = Comment.all

SELECT * FROM "comments" WHERE ("comments"."id" = 1)
---
  def show
    @comment = Comment.find(params[:id])

INSERT INTO "comments" ("created_at", "title", "body", "updated_at", "user_id") VALUES('2009-04-20 20:52:06', 'Awesome', 'Michael is awesome', '2009-04-20 20:52:06', 1)
---
  def create
    @comment = @user.comments.build(params[:comment])
#    params[:comment][:user_id] = params[:user_id]
#    @comment = Comment.new(params[:comment])
    if @comment.save

SELECT * FROM "comments" WHERE ("comments"."id" = 1)
---
  def edit
    @comment = Comment.find(params[:id])

SELECT * FROM "comments" WHERE ("comments"."id" = 1)
UPDATE "comments" SET "updated_at" = '2009-04-20 21:01:19', "body" = 'he talks a lot
---
  def update
    @comment = Comment.find(params[:id])
    if @comment.update_attributes(params[:comment])

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def load_user
    @user ||= User.find_by_id params[:user_id]