roster/app/controllers/comments_controller.rb

  def load_user
    @user ||= User.find params[:user_id]
---
SELECT * FROM "users"