roster/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "netid") VALUES('Michael Libertin', '2009-04-20 20:31:43', '2009-04-20 20:31:43', 'mpl36')